cases/RDE_PHI_2D/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
scale 1;
vertices
(
    ( 0.00  0.00  0.000 )
    ( 0.30  0.00  0.000 )
    ( 0.30  0.15  0.000 )
    ( 0.00  0.15  0.000 )
    ( 0.00  0.00  0.001 )
    ( 0.30  0.00  0.001 )
    ( 0.30  0.15  0.001 )
    ( 0.00  0.15  0.001 )
);
blocks
(
    hex (0 1 2 3 4 5 6 7) ( 300 150  1 ) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet
    {
        type    wall;
        faces   ( (0 1 5 4) );
    }
    outlet
    {
        type    patch;
        faces   ( (3 7 6 2) );
    }
    periodic_left
    {
        type            cyclic;
        neighbourPatch  periodic_right;
        faces           ( (0 4 7 3) );
    }
    periodic_right
    {
        type            cyclic;
        neighbourPatch  periodic_left;
        faces           ( (1 2 6 5) );
    }
    front
    {
        type    empty;
        faces   ( (4 5 6 7) );
    }
    back
    {
        type    empty;
        faces   ( (0 3 2 1) );
    }
);
