cases/RDE_PHI_2D/constant/reactions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}

// ─────────────────────────────────────────────────────────────────────────
species
(
    H2
    O2
    H2O
    N2
);

// ─────────────────────────────────────────────────────────────────────────
//  1-step global H₂ oxidation — detonation-capable Arrhenius kinetics
//  k = A · T^β · exp(−Tₐ/T)
//  Rate: r = k · [H₂]^1 · [O₂]^0.5   (kmol/m³/s)
// ─────────────────────────────────────────────────────────────────────────

reactions
{
    H2Combustion
    {
        type        irreversibleArrheniusReaction;
        reaction    "H2 + 0.5O2 = H2O";
        A           9.87e8;
        beta        0;
        Ta          8052;
    }
}

