cases/RDE_PHI_2D/0/alphat
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object alphat; }
dimensions      [ 1 -1 -1 0 0 0 0 ];
internalField   uniform 0;
boundaryField
{
    inlet           { type    calculated; value uniform 0; }
    outlet          { type    calculated; value uniform 0; }
    periodic_left   { type    cyclic; }
    periodic_right  { type    cyclic; }
    front           { type    empty; }
    back            { type    empty; }
}
